Tekla Open API Reference for Tekla Structures 2025
AnalysisBeamEnd Constructor
 Initializes a new instance of the AnalysisBeamEnd class.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisBeamEnd()
Public Sub New
See Also
Reference
AnalysisBeamEnd Class
Tekla.Structures.Analysis Namespace